DyaaElshater/ITI-Embedded-System/ARM/STM32f103c8/Architecture/4.MCAL/ADC/ADC_prog.c
/****************************************************************/
/**	Name		:	Dyaa Elshater								*/
/**	Date		:	6/1/2019									*/
/**	Description	:	ADC implementation file						*/
/** MCU			:	STM32F103C8									*/
/**	Version		:	1.0 V									`	*/
/****************************************************************/
#include "Std_types.h"
#include "DELAY.h"
#include "Bit_Math.h"

#include "ADC_INT.h"
#include "ADC_CFG.h"
#include "ADC_PRIV.h"


void ADC1_vidINIT()
{
	/*Enable ADC1*/
	SET_BIT(ADC1->CR2,ADON);

	/*Setting ADC1 MODE*/
#if	ADC1_MODE == ADC_CONTINUES_MODE || ADC1_MODE  == ADC_SINGLE_MODE
	ADC1->CR2 |= ADC1_MODE <<CONT ;
#else
	#error "ADC_ERROR : Configure the mode in ADC1 'ADC_CGF.h' "
#endif

#if ADC1_CHANNEL_MODE == ADC_SINGLE_CHANNEL || ADC1_CHANNEL_MODE == ADC_MULTI_CHANNEL
	ADC1->CR1 |= ADC1_CHANNEL_MODE <<SCAN ;
#else
	#error "ADC_ERROR : Configure the mode of Channel in ADC1 'ADC_CGF.h' "
#endif

	/*Setting Caliberation*/
#if ADC1_CAL == ADC_ENABLE_CAL || ADC1_CAL == ADC_DISABLE_CAL
	ADC1->CR2 |= ADC1_CAL <<CAL;
#else
	#error "ADC_ERROR : Configure the Calibration in ADC1 'ADC_CGF.h' "
#endif

	/*Setting Alignment */
#if ADC1_ALIGNMENT == ADC_RIGHT_ALIGN || ADC1_ALIGNMENT  == ADC_LEFT_ALIGN
	ADC1->CR2 |=  ADC1_ALIGNMENT <<ALIGN ;
#else
	#error"ADC_ERROR : Configure the Alignment in ADC1 'ADC_CGF.h' "
#endif

	/*Setting the Regular Sequence*/
	ADC1->SQR1 = ADC1_CHANNELS_LENGTH <<L ;
	ADC1->SQR2 = 0;
	ADC1->SQR3 = 0;

	s8 Loc_s8Index ;
			/*1 -> 6*/
	if (ADC1_CHANNELS_LENGTH>=6)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<6;Loc_s8Index++ )
		{
			ADC1->SQR3 |= ADC1_arrU8RegularSequence[Loc_s8Index] <<(Loc_s8Index*5);
		}
	}
	else
	{
		for (Loc_s8Index =0 ;Loc_s8Index<ADC1_CHANNELS_LENGTH;Loc_s8Index++ )
		{
			ADC1->SQR3 |= ADC1_arrU8RegularSequence[Loc_s8Index] <<(Loc_s8Index*5);
		}
	}
				/*7 -> 12*/
	if (ADC1_CHANNELS_LENGTH>=12)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<6;Loc_s8Index++ )
		{
			ADC1->SQR2 |= ADC1_arrU8RegularSequence[Loc_s8Index+6] <<(Loc_s8Index*5);
		}
	}
	else if (6<ADC1_CHANNELS_LENGTH)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<ADC1_CHANNELS_LENGTH-6;Loc_s8Index++ )
		{
			ADC1->SQR2 |= ADC1_arrU8RegularSequence[Loc_s8Index+6] <<(Loc_s8Index*5);
		}
	}
	else	{}
				/*13 -> 16*/
	if (12<ADC1_CHANNELS_LENGTH &&ADC1_CHANNELS_LENGTH<17 )
	{
		for (Loc_s8Index =0 ;Loc_s8Index<4;Loc_s8Index++ )
		{
			ADC1->SQR1 |= ADC1_arrU8RegularSequence[Loc_s8Index+12] <<(Loc_s8Index*5);
		}
	}
	else	{}

	/*Setting the Injected Sequence*/

	ADC1->JSQR = ADC1_INJECTED_CHANNELS_LENGTH<<JL;
	if (ADC1_INJECTED_CHANNELS_LENGTH<=4)
	{
		u8 loc_u8Shift=15;
		for(Loc_s8Index =ADC1_INJECTED_CHANNELS_LENGTH-1;Loc_s8Index>=0;Loc_s8Index--)
		{
			ADC1->JSQR=ADC1_arrU8InjectedSequence[Loc_s8Index]<<(loc_u8Shift);
			loc_u8Shift-=5 ;
		}
	}
	else {}

	/*Setting the injected triggered event*/
	ADC1->CR2 |= (ADC1_INJECTED_EXT_TRIGGER_EVENT<<JEXTSEL);
	ADC1->CR2 |= (ADC1_INJECTED_EXTERNAL_EVENT_EN<<JEXTTRIG);

	/*Setting the Regular triggered event*/
	ADC1->CR2 |= (ADC1_REGULAR_EXT_TRIGGER_EVENT<<JEXTSEL);
	ADC1->CR2 |= (ADC1_REGULAR_EXTERNAL_EVENT_EN<<JEXTTRIG);

	/*setting temperature sensor*/
	ADC1->CR2 |= ADC1_TEMPERATURE_SENSOR <<TSVREFE ;

	/*Setting Discontinuous mode*/
	ADC1->CR1 |= ADC1_DISCONTINUOUS_MODE_ENABLE<<DISCEN;
	ADC1->CR1 |= ADC1_INJECtED_DISCONTINUOUS_MODE_ENABLE<<JDISCEN;
	ADC1->CR1 |= ADC1_DISCONTINUOUS_MODE_NO_CHANNELS <<DISCNUM;

	/*Setting Dual Mode */
	ADC1->CR1 |= ADC1_DUAL_MODE<<DUALMOD;

}


void ADC2_vidINIT()
{
	/*Enable ADC2*/
	SET_BIT(ADC2->CR2,ADON);

	/*Setting ADC2 MODE*/
#if	ADC2_MODE == ADC_CONTINUES_MODE || ADC2_MODE  == ADC_SINGLE_MODE
	ADC2->CR2 |= ADC2_MODE <<CONT ;
#else
	#error "ADC_ERROR : Configure the mode in ADC2 'ADC_CGF.h' "
#endif

#if ADC2_CHANNEL_MODE == ADC_SINGLE_CHANNEL || ADC2_CHANNEL_MODE == ADC_MULTI_CHANNEL
	ADC2->CR1 |= ADC2_CHANNEL_MODE <<SCAN ;
#else
	#error "ADC_ERROR : Configure the mode of Channel in ADC2 'ADC_CGF.h' "
#endif

	/*Setting Caliberation*/
#if ADC2_CAL == ADC_ENABLE_CAL || ADC2_CAL == ADC_DISABLE_CAL
	ADC2->CR2 |= ADC2_CAL <<CAL;
#else
	#error "ADC_ERROR : Configure the Calibration in ADC2 'ADC_CGF.h' "
#endif

	/*Setting Alignment */
#if ADC2_ALIGNMENT == ADC_RIGHT_ALIGN || ADC2_ALIGNMENT  == ADC_LEFT_ALIGN
	ADC2->CR2 |=  ADC2_ALIGNMENT <<ALIGN ;
#else
	#error"ADC_ERROR : Configure the Alignment in ADC2 'ADC_CGF.h' "
#endif

	/*Setting the Regular Sequence*/
	ADC2->SQR1 = ADC2_CHANNELS_LENGTH <<L ;
	ADC2->SQR2 = 0;
	ADC2->SQR3 = 0;

	s8 Loc_s8Index ;
			/*1 -> 6*/
	if (ADC2_CHANNELS_LENGTH>=6)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<6;Loc_s8Index++ )
		{
			ADC2->SQR3 |= ADC2_arrU8RegularSequence[Loc_s8Index] <<(Loc_s8Index*5);
		}
	}
	else
	{
		for (Loc_s8Index =0 ;Loc_s8Index<ADC2_CHANNELS_LENGTH;Loc_s8Index++ )
		{
			ADC2->SQR3 |= ADC2_arrU8RegularSequence[Loc_s8Index] <<(Loc_s8Index*5);
		}
	}
				/*7 -> 12*/
	if (ADC2_CHANNELS_LENGTH>=12)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<6;Loc_s8Index++ )
		{
			ADC2->SQR2 |= ADC2_arrU8RegularSequence[Loc_s8Index+6] <<(Loc_s8Index*5);
		}
	}
	else if (6<ADC2_CHANNELS_LENGTH)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<ADC2_CHANNELS_LENGTH-6;Loc_s8Index++ )
		{
			ADC2->SQR2 |= ADC2_arrU8RegularSequence[Loc_s8Index+6] <<(Loc_s8Index*5);
		}
	}
	else	{}
				/*13 -> 16*/
	if (12<ADC2_CHANNELS_LENGTH &&ADC2_CHANNELS_LENGTH<17 )
	{
		for (Loc_s8Index =0 ;Loc_s8Index<4;Loc_s8Index++ )
		{
			ADC2->SQR1 |= ADC2_arrU8RegularSequence[Loc_s8Index+12] <<(Loc_s8Index*5);
		}
	}
	else	{}

	/*Setting the Injected Sequence*/

	ADC2->JSQR = ADC2_INJECTED_CHANNELS_LENGTH<<JL;
	if (ADC2_INJECTED_CHANNELS_LENGTH<=4)
	{
		u8 loc_u8Shift=15;
		for(Loc_s8Index =ADC2_INJECTED_CHANNELS_LENGTH-1;Loc_s8Index>=0;Loc_s8Index--)
		{
			ADC2->JSQR=ADC2_arrU8InjectedSequence[Loc_s8Index]<<(loc_u8Shift);
			loc_u8Shift-=5 ;
		}
	}
	else {}
	/*Setting the injected triggered event*/
	ADC2->CR2 |= (ADC2_INJECTED_EXT_TRIGGER_EVENT<<JEXTSEL);
	ADC2->CR2 |= (ADC2_INJECTED_EXTERNAL_EVENT_EN<<JEXTTRIG);

	/*Setting the Regular triggered event*/
	ADC2->CR2 |= (ADC2_REGULAR_EXT_TRIGGER_EVENT<<JEXTSEL);
	ADC2->CR2 |= (ADC2_REGULAR_EXTERNAL_EVENT_EN<<JEXTTRIG);

	/*setting temperature sensor*/
	ADC2->CR2 |= ADC2_TEMPERATURE_SENSOR <<TSVREFE ;

	/*Setting Discontinuous mode*/
	ADC2->CR1 |= ADC2_DISCONTINUOUS_MODE_ENABLE<<DISCEN;
	ADC2->CR1 |= ADC2_INJECtED_DISCONTINUOUS_MODE_ENABLE<<JDISCEN;
	ADC2->CR1 |= ADC2_DISCONTINUOUS_MODE_NO_CHANNELS <<DISCNUM;

