DyaaElshater/ITI-Embedded-System/ARM/STM32f103c8/Architecture/4.MCAL/ADC/ADC_prog.c
}
void ADC3_vidINIT()
{
	/*Enable ADC3*/
	SET_BIT(ADC3->CR2,ADON);

	/*Setting ADC3 MODE*/
#if	ADC3_MODE == ADC_CONTINUES_MODE || ADC3_MODE  == ADC_SINGLE_MODE
	ADC3->CR2 |= ADC3_MODE <<CONT ;
#else
	#error "ADC_ERROR : Configure the mode in ADC3 'ADC_CGF.h' "
#endif

#if ADC3_CHANNEL_MODE == ADC_SINGLE_CHANNEL || ADC3_CHANNEL_MODE == ADC_MULTI_CHANNEL
	ADC3->CR1 |= ADC3_CHANNEL_MODE <<SCAN ;
#else
	#error "ADC_ERROR : Configure the mode of Channel in ADC3 'ADC_CGF.h' "
#endif

	/*Setting Caliberation*/
#if ADC3_CAL == ADC_ENABLE_CAL || ADC3_CAL == ADC_DISABLE_CAL
	ADC3->CR2 |= ADC3_CAL <<CAL;
#else
	#error "ADC_ERROR : Configure the Calibration in ADC3 'ADC_CGF.h' "
#endif

	/*Setting Alignment */
#if ADC3_ALIGNMENT == ADC_RIGHT_ALIGN || ADC3_ALIGNMENT  == ADC_LEFT_ALIGN
	ADC3->CR2 |=  ADC3_ALIGNMENT <<ALIGN ;
#else
	#error"ADC_ERROR : Configure the Alignment in ADC3 'ADC_CGF.h' "
#endif

	/*Setting the Regular Sequence*/
	ADC3->SQR1 = ADC3_CHANNELS_LENGTH <<L ;
	ADC3->SQR2 = 0;
	ADC3->SQR3 = 0;

	s8 Loc_s8Index ;
			/*1 -> 6*/
	if (ADC3_CHANNELS_LENGTH>=6)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<6;Loc_s8Index++ )
		{
			ADC3->SQR3 |= ADC3_arrU8RegularSequence[Loc_s8Index] <<(Loc_s8Index*5);
		}
	}
	else
	{
		for (Loc_s8Index =0 ;Loc_s8Index<ADC3_CHANNELS_LENGTH;Loc_s8Index++ )
		{
			ADC3->SQR3 |= ADC3_arrU8RegularSequence[Loc_s8Index] <<(Loc_s8Index*5);
		}
	}
				/*7 -> 12*/
	if (ADC3_CHANNELS_LENGTH>=12)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<6;Loc_s8Index++ )
		{
			ADC3->SQR2 |= ADC3_arrU8RegularSequence[Loc_s8Index+6] <<(Loc_s8Index*5);
		}
	}
	else if (6<ADC3_CHANNELS_LENGTH)
	{
		for (Loc_s8Index =0 ;Loc_s8Index<ADC3_CHANNELS_LENGTH-6;Loc_s8Index++ )
		{
			ADC3->SQR2 |= ADC3_arrU8RegularSequence[Loc_s8Index+6] <<(Loc_s8Index*5);
		}
	}
	else	{}
				/*13 -> 16*/
	if (12<ADC3_CHANNELS_LENGTH &&ADC3_CHANNELS_LENGTH<17 )
	{
		for (Loc_s8Index =0 ;Loc_s8Index<4;Loc_s8Index++ )
		{
			ADC3->SQR1 |= ADC3_arrU8RegularSequence[Loc_s8Index+12] <<(Loc_s8Index*5);
		}
	}
	else	{}

	/*Setting the Injected Sequence*/

	ADC3->JSQR = ADC3_INJECTED_CHANNELS_LENGTH<<JL;
	if (ADC3_INJECTED_CHANNELS_LENGTH<=4)
	{
		u8 loc_u8Shift=15;
		for(Loc_s8Index =ADC3_INJECTED_CHANNELS_LENGTH-1;Loc_s8Index>=0;Loc_s8Index--)
		{
			ADC3->JSQR=ADC3_arrU8InjectedSequence[Loc_s8Index]<<(loc_u8Shift);
			loc_u8Shift-=5 ;
		}
	}
	else {}
	/*Setting the injected triggered event*/
	ADC3->CR2 |= (ADC1_INJECTED_EXT_TRIGGER_EVENT<<JEXTSEL);
	ADC3->CR2 |= (ADC3_INJECTED_EXTERNAL_EVENT_EN<<JEXTTRIG);

	/*Setting the Regular triggered event*/
	ADC3->CR2 |= (ADC3_REGULAR_EXT_TRIGGER_EVENT<<JEXTSEL);
	ADC3->CR2 |= (ADC3_REGULAR_EXTERNAL_EVENT_EN<<JEXTTRIG);

	/*setting temperature sensor*/
	ADC3->CR2 |= ADC3_TEMPERATURE_SENSOR <<TSVREFE ;

	/*Setting Discontinuous mode*/
	ADC3->CR1 |= ADC3_DISCONTINUOUS_MODE_ENABLE<<DISCEN;
	ADC3->CR1 |= ADC3_INJECtED_DISCONTINUOUS_MODE_ENABLE<<JDISCEN;
	ADC3->CR1 |= ADC3_DISCONTINUOUS_MODE_NO_CHANNELS <<DISCNUM;

}


void ADC1_vidRegularChannel_Start()
{
	SET_BIT(ADC1->CR2 , SWSTART);
}
void ADC2_vidRegularChannel_Start()
{
	SET_BIT(ADC2->CR2 , SWSTART);
}
void ADC3_vidRegularChannel_Start()
{
	SET_BIT(ADC3->CR2 , SWSTART);
}


void ADC1_vidInjectedChannel_Start()
{
	SET_BIT(ADC1->CR2,JSWSTART);
}
void ADC2_vidInjectedChannel_Start()
{
	SET_BIT(ADC2->CR2,JSWSTART);
}
void ADC3_vidInjectedChannel_Start()
{
	SET_BIT(ADC3->CR2,JSWSTART);
}


u32 ADC1_u32RegularRead()
{
	return ADC1->DR ;
}
u32 ADC1_u32InjectedRead_JDR1()
{
	return ADC1->JDR1 ;
}
u32 ADC1_u32InjectedRead_JDR2()
{
	return ADC1->JDR2 ;
}
u32 ADC1_u32InjectedRead_JDR3()
{
	return ADC1->JDR3 ;
}
u32 ADC1_u32InjectedRead_JDR4()
{
	return ADC1->JDR4 ;
}

u32 ADC2_u32RegularRead()
{
	return ADC2->DR ;
}

u32 ADC2_u32InjectedRead_JDR1()
{
	return ADC2->JDR1	;
}
u32 ADC2_u32InjectedRead_JDR2()
{
	return ADC2->JDR2;
}
u32 ADC2_u32InjectedRead_JDR3()
{
	return ADC2->JDR3;
}
u32 ADC2_u32InjectedRead_JDR4()
{
	return ADC2->JDR4;
}

u32 ADC3_u32RegularRead()
{
	return ADC3->DR ;
}

u32 ADC3_u32InjectedRead_JDR1()
{
	return ADC3->JDR1;
}
u32 ADC3_u32InjectedRead_JDR2()
{
	return ADC3->JDR2;
}
u32 ADC3_u32InjectedRead_JDR3()
{
	return ADC3->JDR3;
}
u32 ADC3_u32InjectedRead_JDR4()
{
	return ADC3->JDR4;
}

void ADC1_vidResetCalibration(void)
{
	SET_BIT(ADC1->CR2,RSTCAL);
}
void ADC2_vidResetCalibration(void)
{
	SET_BIT(ADC2->CR2,RSTCAL);
}
void ADC3_vidResetCalibration(void)
{
	SET_BIT(ADC3->CR2,RSTCAL);
}

void ADC1_vidSetAlign(tdefADC_ALIGN enuAdcAlignCpy)
{
	ADC1->CR2 &= ~(1<<ALIGN);
	ADC1->CR2 |= enuAdcAlignCpy<<ALIGN ;
}
void ADC2_vidSetAlign(tdefADC_ALIGN enuAdcAlignCpy)
{
	ADC2->CR2 &= ~(1<<ALIGN);
	ADC2->CR2 |= enuAdcAlignCpy<<ALIGN ;
}
void ADC3_vidSetAlign(tdefADC_ALIGN enuAdcAlignCpy)
{
	ADC3->CR2 &= ~(1<<ALIGN);
	ADC3->CR2 |= enuAdcAlignCpy<<ALIGN ;
}

void ADC1_vidSetInjectedExtTriggeredEvent(tdefInjectedExtTrigger enuInjectedExtTriggerCpy)
{
	ADC1->CR2 &= ~(7<<JEXTSEL);
	ADC1->CR2 |= (enuInjectedExtTriggerCpy<<JEXTSEL);
}
void ADC2_vidSetInjectedExtTriggeredEvent(tdefInjectedExtTrigger enuInjectedExtTriggerCpy)
{
	ADC2->CR2 &= ~(7<<JEXTSEL);
	ADC2->CR2 |= (enuInjectedExtTriggerCpy<<JEXTSEL);
}
void ADC3_vidSetInjectedExtTriggeredEvent(tdefInjectedExtTrigger enuInjectedExtTriggerCpy)
{
	ADC3->CR2 &= ~(7<<JEXTSEL);
	ADC3->CR2 |= (enuInjectedExtTriggerCpy<<JEXTSEL);
}

void ADC1_vidEnableInjectedExternalEvent(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR2,JEXTTRIG);
	ADC1->CR2 |= enuAdcEnCpy<<JEXTTRIG ;
}
void ADC2_vidEnableInjectedExternalEvent(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR2,JEXTTRIG);
	ADC2->CR2 |= enuAdcEnCpy<<JEXTTRIG ;
}
void ADC3_vidEnableInjectedExternalEvent(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR2,JEXTTRIG);
	ADC2->CR2 |= enuAdcEnCpy<<JEXTTRIG ;
}


void ADC1_vidSetRegularExtTriggeredEvent(tdefRegularExtTrigger enuRegularExtTriggerCpy)
{
	ADC1->CR2 &= ~(7<<EXTSEL);
	ADC1->CR2 |= (enuRegularExtTriggerCpy<<EXTSEL);
}
void ADC2_vidSetRegularExtTriggeredEvent(tdefRegularExtTrigger enuRegularExtTriggerCpy)
{
	ADC2->CR2 &= ~(7<<EXTSEL);
	ADC2->CR2 |= (enuRegularExtTriggerCpy<<EXTSEL);
}
void ADC3_vidSetRegularExtTriggeredEvent(tdefRegularExtTrigger enuRegularExtTriggerCpy)
{
	ADC3->CR2 &= ~(7<<EXTSEL);
	ADC3->CR2 |= (enuRegularExtTriggerCpy<<EXTSEL);
}

void ADC1_vidEnableRegularExternalEvent(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR2,EXTTRIG);
	ADC1->CR2 |= enuAdcEnCpy<<EXTTRIG ;
}
void ADC2_vidEnableRegularExternalEvent(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR2,EXTTRIG);
	ADC2->CR2 |= enuAdcEnCpy<<EXTTRIG ;
}
void ADC3_vidEnableRegularExternalEvent(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR2,EXTTRIG);
	ADC3->CR2 |= enuAdcEnCpy<<EXTTRIG ;
}

void ADC1_vidSetRegularSoftwareTrigger(void)
{
	SET_BIT(ADC1->CR2,SWSTART);
}
void ADC2_vidSetRegularSoftwareTrigger(void)
{
	SET_BIT(ADC2->CR2,SWSTART);
}
void ADC3_vidSetRegularSoftwareTrigger(void)
{
	SET_BIT(ADC3->CR2,SWSTART);
}

void ADC1_vidSetInjectedSoftwareTrigger(void)
{
	SET_BIT(ADC1->CR2,JSWSTART);
}
void ADC2_vidSetInjectedSoftwareTrigger(void)
{
	SET_BIT(ADC2->CR2,JSWSTART);
}
void ADC3_vidSetInjectedSoftwareTrigger(void)
{
	SET_BIT(ADC3->CR2,JSWSTART);
}

void ADC1_vidSetTemperatureEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR2,TSVREFE);
	ADC1->CR2 |= enuAdcEnCpy<<TSVREFE ;
}
void ADC2_vidSetTemperatureEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR2,TSVREFE);
	ADC2->CR2 |= enuAdcEnCpy<<TSVREFE ;
}
void ADC3_vidSetTemperatureEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR2,TSVREFE);
	ADC3->CR2 |= enuAdcEnCpy<<TSVREFE ;
}

u16 ADC1_u16GetTemperatureValue(void)
{
	CLEAR_BIT(ADC1->CR1,SCAN);
	u32 Loc_u32Template = ADC1->SQR3 ;
	ADC1->SQR3 &= ~(0x0f);
	ADC1->SQR3 |= ADC_CHANNEL16;
	SET_BIT(ADC1->CR2 , SWSTART);
	SET_BIT(ADC1->CR2 , TSVREFE);

