DyaaElshater/ITI-Embedded-System/ARM/STM32f103c8/Architecture/4.MCAL/ADC/ADC_prog.c
	u32 loc_u32Result = ADC1->DR ;
	CLEAR_BIT(ADC1->CR2 , TSVREFE);
	ADC1->SQR3 = Loc_u32Template;
	ADC1->CR1 |= ADC1_CHANNEL_MODE <<SCAN ;
	return loc_u32Result;
}
u16 ADC2_u16GetTemperatureValue(void)
{
	CLEAR_BIT(ADC2->CR1,SCAN);
	u32 Loc_u32Template = ADC2->SQR3 ;
	ADC2->SQR3 &= ~(0x0f);
	ADC2->SQR3 |= ADC_CHANNEL16;
	SET_BIT(ADC2->CR2 , SWSTART);
	SET_BIT(ADC2->CR2 , TSVREFE);
	u32 loc_u32Result = ADC2->DR ;
	CLEAR_BIT(ADC2->CR2 , TSVREFE);
	ADC2->SQR3 = Loc_u32Template;
	ADC2->CR1 |= ADC1_CHANNEL_MODE <<SCAN ;
	return loc_u32Result;
}
u16 ADC3_u16GetTemperatureValue(void)
{
	CLEAR_BIT(ADC3->CR1,SCAN);
	u32 Loc_u32Template = ADC3->SQR3 ;
	ADC3->SQR3 &= ~(0x0f);
	ADC3->SQR3 |= ADC_CHANNEL16;
	SET_BIT(ADC3->CR2 , SWSTART);
	SET_BIT(ADC3->CR2 , TSVREFE);
	u32 loc_u32Result = ADC3->DR ;
	CLEAR_BIT(ADC3->CR2 , TSVREFE);
	ADC3->SQR3 = Loc_u32Template;
	ADC3->CR1 |= ADC1_CHANNEL_MODE <<SCAN ;
	return loc_u32Result;
}

void ADC1_vidDMA_Enable(void)
{
	SET_BIT(ADC1->CR1,DMA);
}
void ADC1_vidDMA_Disable(void)
{
	CLEAR_BIT(ADC1->CR1,DMA);
}
void ADC2_vidDMA_Enable(void)
{
	SET_BIT(ADC2->CR2,DMA);
}
void ADC2_vidDMA_Disable(void)
{
	CLEAR_BIT(ADC2->CR1,DMA);
}
void ADC3_vidDMA_Enable(void)
{
	SET_BIT(ADC3->CR1,DMA);
}
void ADC3_vidDMA_Disable(void)
{
	CLEAR_BIT(ADC3->CR1,DMA);
}

void ADC1_vidSelectWatchDogChannels(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->CR1 &= ~(0x1f);
	ADC1->CR1 |= enuAdcChannelCpy;
}
void ADC2_vidSelectWatchDogChannels(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->CR1 &= ~(0x1f);
	ADC2->CR1 |= enuAdcChannelCpy;
}
void ADC3_vidSelectWatchDogChannels(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->CR1 &= ~(0x1f);
	ADC3->CR1 |= enuAdcChannelCpy;
}

void ADC1_vidWatchDogEnableScanMode(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC1->CR1,AWDSGL);
	ADC1->CR1 |= enuAdcEn<<AWDSGL;
}
void ADC2_vidWatchDogEnableScanMode(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC2->CR1,AWDSGL);
	ADC2->CR1 |= enuAdcEn<<AWDSGL;
}
void ADC3_vidWatchDogEnableScanMode(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC3->CR1,AWDSGL);
	ADC3->CR1 |= enuAdcEn<<AWDSGL;
}

void ADC1_vidEnableEndOfConvertionInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC1->CR1,EOCIE);
	ADC1->CR1 |= enuAdcEn<<EOCIE;
}
void ADC2_vidEnableEndOfConvertionInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC2->CR1,EOCIE);
	ADC2->CR1 |= enuAdcEn<<EOCIE;
}
void ADC3_vidEnableEndOfConvertionInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC3->CR1,EOCIE);
	ADC3->CR1 |= enuAdcEn<<EOCIE;
}


void ADC1_vidSetEndOfConvertionCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_EOC[1]=pfCallBackCpy;
}
void ADC2_vidSetEndOfConvertionCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_EOC[2]=pfCallBackCpy;
}
void ADC3_vidSetEndOfConvertionCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_EOC[3]=pfCallBackCpy;
}

void ADC1_vidEnableWatchDogInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC1->CR1,AWDIE);
	ADC1->CR1 |= enuAdcEn<<AWDIE;
}
void ADC2_vidEnableWatchDogInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC2->CR1,AWDIE);
	ADC2->CR1 |= enuAdcEn<<AWDIE;
}
void ADC3_vidEnableWatchDogInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC3->CR1,AWDIE);
	ADC3->CR1 |= enuAdcEn<<AWDIE;
}

void ADC1_vidSetWatchDogCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_WD[1]=pfCallBackCpy;
}
void ADC2_vidSetWatchDogCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_WD[2]=pfCallBackCpy;
}
void ADC3_vidSetWatchDogCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_WD[3]=pfCallBackCpy;
}

void ADC1_vidEnableEndOfConvertionInjectedChannelsInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC1->CR1,JEOCIE);
	ADC1->CR1 |= enuAdcEn<<JEOCIE;
}
void ADC2_vidEnableEndOfConvertionInjectedChannelsInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC2->CR1,JEOCIE);
	ADC2->CR1 |= enuAdcEn<<JEOCIE;
}
void ADC3_vidEnableEndOfConvertionInjectedChannelsInterrupt(tdefAdcEn enuAdcEn)
{
	CLEAR_BIT(ADC3->CR1,JEOCIE);
	ADC3->CR1 |= enuAdcEn<<JEOCIE;
}

void ADC1_vidSetEndOfConvertionInjectedChannelsCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_JEOC[1]=pfCallBackCpy;
}
void ADC2_vidSetEndOfConvertionInjectedChannelsCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_JEOC[2]=pfCallBackCpy;
}
void ADC3_vidSetEndOfConvertionInjectedChannelsCallBackFunction(vidpfvid pfCallBackCpy)
{
	ADC_JEOC[3]=pfCallBackCpy;
}

void ADC1_vidAutomaticInjectedGroupconversionEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR1,JAUTO);
	ADC1->CR1 |= enuAdcEnCpy<<JAUTO ;
}
void ADC2_vidAutomaticInjectedGroupconversionEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR1,JAUTO);
	ADC2->CR1 |= enuAdcEnCpy<<JAUTO ;
}
void ADC3_vidAutomaticInjectedGroupconversionEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR1,JAUTO);
	ADC3->CR1 |= enuAdcEnCpy<<JAUTO ;
}

void ADC1_vidDiscontinuousModeEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR1,DISCEN);
	ADC1->CR1 |= enuAdcEnCpy<<DISCEN ;
}
void ADC2_vidDiscontinuousModeEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR1,DISCEN);
	ADC2->CR1 |= enuAdcEnCpy<<DISCEN ;
}
void ADC3_vidDiscontinuousModeEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR1,DISCEN);
	ADC3->CR1 |= enuAdcEnCpy<<DISCEN ;
}

void ADC1_vidDiscontinuousModeInjectedChannelEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR1,JDISCEN);
	ADC1->CR1 |= enuAdcEnCpy<<JDISCEN ;
}
void ADC2_vidDiscontinuousModeInjectedChannelEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR1,JDISCEN);
	ADC2->CR1 |= enuAdcEnCpy<<JDISCEN ;
}
void ADC3_vidDiscontinuousModeInjectedChannelEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR1,JDISCEN);
	ADC3->CR1 |= enuAdcEnCpy<<JDISCEN ;
}

void ADC1_vidSetDiscontinuousChannelNumber(tdefAdcNODiscontinuousCh enuAdcNODiscontinuousCh)
{
	ADC1->CR1 &= ~(0x7<<DISCNUM);
	ADC1->CR1 |= enuAdcNODiscontinuousCh<<DISCNUM ;
}
void ADC2_vidSetDiscontinuousChannelNumber(tdefAdcNODiscontinuousCh enuAdcNODiscontinuousCh)
{
	ADC2->CR1 &= ~(0x7<<DISCNUM);
	ADC2->CR1 |= enuAdcNODiscontinuousCh<<DISCNUM ;
}
void ADC3_vidSetDiscontinuousChannelNumber(tdefAdcNODiscontinuousCh enuAdcNODiscontinuousCh)
{
	ADC3->CR1 &= ~(0x7<<DISCNUM);
	ADC3->CR1 |= enuAdcNODiscontinuousCh<<DISCNUM ;
}

void ADC1_vidDualMode(tdefAdcDualMode enumAdcDualModeCpy)
{
	ADC1->CR1 &= ~(0XF<<DUALMOD);
	ADC1->CR1 |= enumAdcDualModeCpy<<DUALMOD;
}

void ADC1_vidWatchDogEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR1,AWDEN);
	ADC1->CR1 |= enuAdcEnCpy<<AWDEN;
}
void ADC2_vidWatchDogEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR1,AWDEN);
	ADC2->CR1 |= enuAdcEnCpy<<AWDEN;
}
void ADC3_vidWatchDogEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR1,AWDEN);
	ADC3->CR1 |= enuAdcEnCpy<<AWDEN;
}

void ADC1_vidInjectedWatchDogEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC1->CR1,JAWDEN);
	ADC1->CR1 |= enuAdcEnCpy<<JAWDEN;
}
void ADC2_vidInjectedWatchDogEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC2->CR1,JAWDEN);
	ADC2->CR1 |= enuAdcEnCpy<<JAWDEN;
}
void ADC3_vidInjectedWatchDogEnable(tdefAdcEn enuAdcEnCpy)
{
	CLEAR_BIT(ADC3->CR1,JAWDEN);
	ADC3->CR1 |= enuAdcEnCpy<<JAWDEN;
}


void ADC1_vidSetRegularLength(u8 u8LengthCpy)
{
	ADC1->SQR1 &= ~(0xf<<L) ;
	ADC1->SQR1 |= u8LengthCpy<<L;
}
void ADC1_vidSetSQR1(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR3 &= ~(0xf<<SQ1) ;
	ADC1->SQR3 |= enuAdcChannelCpy<<SQ1;
}
void ADC1_vidSetSQR2(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR3 &= ~(0xf<<SQ2) ;
	ADC1->SQR3 |= enuAdcChannelCpy<<SQ2;
}
void ADC1_vidSetSQR3(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR3 &= ~(0xf<<SQ3 );
	ADC1->SQR3 |= enuAdcChannelCpy<<SQ3;
}
void ADC1_vidSetSQR4(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR3 &= ~(0xf<<SQ4) ;
	ADC1->SQR3 |= enuAdcChannelCpy<<SQ4;
}
void ADC1_vidSetSQR5(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR3 &= ~(0xf<<SQ5 );
	ADC1->SQR3 |= enuAdcChannelCpy<<SQ5;
}
void ADC1_vidSetSQR6(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR3 &= ~(0xf<<SQ6 );
	ADC1->SQR3 |= enuAdcChannelCpy<<SQ6;
}
void ADC1_vidSetSQR7(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR2 &= ~(0xf<<SQ7 );
	ADC1->SQR2 |= enuAdcChannelCpy<<SQ7;
}
void ADC1_vidSetSQR8(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR2 &= ~(0xf<<SQ8);
	ADC1->SQR2 |= enuAdcChannelCpy<<SQ8;
}
void ADC1_vidSetSQR9(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR2 &= ~(0xf<<SQ9);
	ADC1->SQR2 |= enuAdcChannelCpy<<SQ9;
}
void ADC1_vidSetSQR10(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR2 &= ~(0xf<<SQ10);
	ADC1->SQR2 |= enuAdcChannelCpy<<SQ10;
}
void ADC1_vidSetSQR11(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR2 &= ~(0xf<<SQ11);
	ADC1->SQR2 |= enuAdcChannelCpy<<SQ11;
}
void ADC1_vidSetSQR12(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR2 &= ~(0xf<<SQ12);
	ADC1->SQR2 |= enuAdcChannelCpy<<SQ12;
}
void ADC1_vidSetSQR13(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR1 &= ~(0xf<<SQ13);
	ADC1->SQR1 |= enuAdcChannelCpy<<SQ13;
}
void ADC1_vidSetSQR14(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR1 &= ~(0xf<<SQ14);
	ADC1->SQR1 |= enuAdcChannelCpy<<SQ14;
}
void ADC1_vidSetSQR15(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR1 &= ~(0xf<<SQ15);
	ADC1->SQR1 |= enuAdcChannelCpy<<SQ15;
}
void ADC1_vidSetSQR16(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->SQR1 &= ~(0xf<<SQ16);
	ADC1->SQR1 |= enuAdcChannelCpy<<SQ16;
}
void ADC1_vidSetInjectedLength(u8 u8Length)
{
	ADC1->JSQR &= ~(0xf<<JL);
	ADC1->JSQR |= u8Length<<JL;
}
void ADC1_vidSetJSQR1(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->JSQR &= ~(0xf<<JSQ1);
	ADC1->JSQR |= enuAdcChannelCpy<<JSQ1;
}
void ADC1_vidSetJSQR2(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->JSQR &= ~(0xf<<JSQ2);
	ADC1->JSQR |= enuAdcChannelCpy<<JSQ2;
}
void ADC1_vidSetJSQR3(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->JSQR &= ~(0xf<<JSQ3);
	ADC1->JSQR |= enuAdcChannelCpy<<JSQ3;
}
void ADC1_vidSetJSQR4(tdefAdcChannels enuAdcChannelCpy)
{
	ADC1->JSQR &= ~(0xf<<JSQ4);
	ADC1->JSQR |= enuAdcChannelCpy<<JSQ4;
}


void ADC2_vidSetRegularLength(u8 u8LengthCpy)
{
	ADC2->SQR1 &= ~(0xf<<L) ;
	ADC2->SQR1 |= u8LengthCpy<<L;
}
void ADC2_vidSetSQR1(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR3 &= ~(0xf<<SQ1) ;
	ADC2->SQR3 |= enuAdcChannelCpy<<SQ1;
}
void ADC2_vidSetSQR2(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR3 &= ~(0xf<<SQ2) ;
	ADC2->SQR3 |= enuAdcChannelCpy<<SQ2;
}
void ADC2_vidSetSQR3(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR3 &= ~(0xf<<SQ3 );
	ADC2->SQR3 |= enuAdcChannelCpy<<SQ3;
}
void ADC2_vidSetSQR4(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR3 &= ~(0xf<<SQ4) ;
	ADC2->SQR3 |= enuAdcChannelCpy<<SQ4;
}
void ADC2_vidSetSQR5(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR3 &= ~(0xf<<SQ5 );
	ADC2->SQR3 |= enuAdcChannelCpy<<SQ5;
}
void ADC2_vidSetSQR6(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR3 &= ~(0xf<<SQ6 );
	ADC2->SQR3 |= enuAdcChannelCpy<<SQ6;
}
void ADC2_vidSetSQR7(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR2 &= ~(0xf<<SQ7 );
	ADC2->SQR2 |= enuAdcChannelCpy<<SQ7;
}
void ADC2_vidSetSQR8(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR2 &= ~(0xf<<SQ8);
	ADC2->SQR2 |= enuAdcChannelCpy<<SQ8;
}
void ADC2_vidSetSQR9(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR2 &= ~(0xf<<SQ9);
	ADC2->SQR2 |= enuAdcChannelCpy<<SQ9;
}
void ADC2_vidSetSQR10(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR2 &= ~(0xf<<SQ10);
	ADC2->SQR2 |= enuAdcChannelCpy<<SQ10;
}
void ADC2_vidSetSQR11(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR2 &= ~(0xf<<SQ11);
	ADC2->SQR2 |= enuAdcChannelCpy<<SQ11;
}
void ADC2_vidSetSQR12(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR2 &= ~(0xf<<SQ12);
	ADC2->SQR2 |= enuAdcChannelCpy<<SQ12;
}
void ADC2_vidSetSQR13(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR1 &= ~(0xf<<SQ13);
	ADC2->SQR1 |= enuAdcChannelCpy<<SQ13;
}
void ADC2_vidSetSQR14(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR1 &= ~(0xf<<SQ14);
	ADC2->SQR1 |= enuAdcChannelCpy<<SQ14;
}
void ADC2_vidSetSQR15(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR1 &= ~(0xf<<SQ15);
	ADC2->SQR1 |= enuAdcChannelCpy<<SQ15;
}
void ADC2_vidSetSQR16(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->SQR1 &= ~(0xf<<SQ16);
	ADC2->SQR1 |= enuAdcChannelCpy<<SQ16;
}
void ADC2_vidSetInjectedLength(u8 u8Length)
{
	ADC2->JSQR &= ~(0xf<<JL);
	ADC2->JSQR |= u8Length<<JL;
}
void ADC2_vidSetJSQR1(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->JSQR &= ~(0xf<<JSQ1);
	ADC2->JSQR |= enuAdcChannelCpy<<JSQ1;
}
void ADC2_vidSetJSQR2(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->JSQR &= ~(0xf<<JSQ2);
	ADC2->JSQR |= enuAdcChannelCpy<<JSQ2;
}
void ADC2_vidSetJSQR3(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->JSQR &= ~(0xf<<JSQ3);
	ADC2->JSQR |= enuAdcChannelCpy<<JSQ3;
}
void ADC2_vidSetJSQR4(tdefAdcChannels enuAdcChannelCpy)
{
	ADC2->JSQR &= ~(0xf<<JSQ4);
	ADC2->JSQR |= enuAdcChannelCpy<<JSQ4;
}


void ADC3_vidSetRegularLength(u8 u8LengthCpy)
{
	ADC3->SQR1 &= ~(0xf<<L) ;
	ADC3->SQR1 |= u8LengthCpy<<L;
}
void ADC3_vidSetSQR1(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR3 &= ~(0xf<<SQ1) ;
	ADC3->SQR3 |= enuAdcChannelCpy<<SQ1;
}
void ADC3_vidSetSQR2(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR3 &= ~(0xf<<SQ2) ;
	ADC3->SQR3 |= enuAdcChannelCpy<<SQ2;
}
void ADC3_vidSetSQR3(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR3 &= ~(0xf<<SQ3 );
	ADC3->SQR3 |= enuAdcChannelCpy<<SQ3;
}
void ADC3_vidSetSQR4(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR3 &= ~(0xf<<SQ4) ;
	ADC3->SQR3 |= enuAdcChannelCpy<<SQ4;
}
void ADC3_vidSetSQR5(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR3 &= ~(0xf<<SQ5 );
	ADC3->SQR3 |= enuAdcChannelCpy<<SQ5;
}
void ADC3_vidSetSQR6(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR3 &= ~(0xf<<SQ6 );
	ADC3->SQR3 |= enuAdcChannelCpy<<SQ6;
}
void ADC3_vidSetSQR7(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR2 &= ~(0xf<<SQ7 );
	ADC3->SQR2 |= enuAdcChannelCpy<<SQ7;
}
void ADC3_vidSetSQR8(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR2 &= ~(0xf<<SQ8);
	ADC3->SQR2 |= enuAdcChannelCpy<<SQ8;
}
void ADC3_vidSetSQR9(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR2 &= ~(0xf<<SQ9);
	ADC3->SQR2 |= enuAdcChannelCpy<<SQ9;
}
void ADC3_vidSetSQR10(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR2 &= ~(0xf<<SQ10);
	ADC3->SQR2 |= enuAdcChannelCpy<<SQ10;
}
void ADC3_vidSetSQR11(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR2 &= ~(0xf<<SQ11);
	ADC3->SQR2 |= enuAdcChannelCpy<<SQ11;
}
void ADC3_vidSetSQR12(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR2 &= ~(0xf<<SQ12);
	ADC3->SQR2 |= enuAdcChannelCpy<<SQ12;
}
void ADC3_vidSetSQR13(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR1 &= ~(0xf<<SQ13);
	ADC3->SQR1 |= enuAdcChannelCpy<<SQ13;
}
void ADC3_vidSetSQR14(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR1 &= ~(0xf<<SQ14);
	ADC3->SQR1 |= enuAdcChannelCpy<<SQ14;
}
void ADC3_vidSetSQR15(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR1 &= ~(0xf<<SQ15);
	ADC3->SQR1 |= enuAdcChannelCpy<<SQ15;
}
void ADC3_vidSetSQR16(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->SQR1 &= ~(0xf<<SQ16);
	ADC3->SQR1 |= enuAdcChannelCpy<<SQ16;
}
void ADC3_vidSetInjectedLength(u8 u8Length)
{
	ADC3->JSQR &= ~(0xf<<JL);
	ADC3->JSQR |= u8Length<<JL;
}
void ADC3_vidSetJSQR1(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->JSQR &= ~(0xf<<JSQ1);
	ADC3->JSQR |= enuAdcChannelCpy<<JSQ1;
}
void ADC3_vidSetJSQR2(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->JSQR &= ~(0xf<<JSQ2);
	ADC3->JSQR |= enuAdcChannelCpy<<JSQ2;
}
void ADC3_vidSetJSQR3(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->JSQR &= ~(0xf<<JSQ3);
	ADC3->JSQR |= enuAdcChannelCpy<<JSQ3;
}
void ADC3_vidSetJSQR4(tdefAdcChannels enuAdcChannelCpy)
{
	ADC3->JSQR &= ~(0xf<<JSQ4);
	ADC3->JSQR |= enuAdcChannelCpy<<JSQ4;
}
